export const questions = [
  "您的研究对象是什么？（例：大脑）",
  "您的研究想要解决关于这个对象的什么问题？（例：大脑在发育中形状是否会改变）",
  "您的研究想要验证什么假设？（例：我们想要验证大脑在发育后沟壑是否会变深）",
  "您的研究得到了什么结果？（例：在12-25岁期间，人类的大脑沟壑会逐年加深）",
  "这些结果表明了什么？（例：形状变化确实是大脑发育过程中的一部分）",
  "您的研究对领域有何贡献？（例：我们的研究是第一个长时间追踪记录发育中大脑形状的实验，并验证了大脑发育过程中形状不断变化的假设）"
];

export const hints = {
  Abstract: [
    "介绍本研究对象问题，1句。",
    "转折，说明此问题依然不明朗，引出您研究的必要性，1句。",
    "讲述此研究实验过程和实验对象，1句。",
    "讲述发现，1句。",
    "讲述发现意义，1句。",
    "漂亮！您已完成本部分所需的所有内容！请点击左侧相应菜单进入下一部分的写作。"
  ],
  Introduction: [
    "简介研究主体，1-2句。",
    "描述该研究主体在实际应用中的重要性，1段，3-4句实际应用重要性+1句总结（所以研究它非常重要）。",
    "介绍您本文研究的小方向，引用前人文献，层层递进，直到得出您要研究的方向很重要，1-2段，4-7句您研究的方向将如何影响对此研究主体的理解和应用+1句'所以研究我们的方向将大大有助于理解和运用XX'。",
    "继续引用前人，层层递进，将前人工作中的发现汇聚成您的假设，1-2段，4-7句这个方向有XX悬而未决的问题，前人发现XX但并没有解决这个问题，另外的前人XX的研究让我们相信XX+1句'所以我们测试了这个假设'。",
    "综述自己的研究对象和过程，必要时提到并简介自己使用的工具，1段，4-5句所以我们做了XXX研究，使用了XXX方法，过程为XXX+1句'我们的研究有重大意义'。",
    "漂亮！您已完成本部分所需的所有内容！请点击左侧相应菜单进入下一部分的写作。"
  ],
  Methods: [
    "介绍您的实验对象或者研究所使用的数据来源，1段3-4句。",
    "介绍实验流程及实验任务，1段5-7句。",
    "介绍数据收集方法和细节，1段4-6句（包括数据的具体数量，分布及类别）。",
    "介绍数据分析方法和细节，1段4-6句。",
    "漂亮！您已完成本部分所需的所有内容！请点击左侧相应菜单进入下一部分的写作。"
  ],
  Results: [
    "对于每一张图，按照以下步骤写成一段：首先由背景产生的假设和疑问 (previous researches have shown that...) 或沿着上一张图的逻辑叙述目的（To confirm this hypothesis...），2-3句。",
    "描述此实验的目的 (可以to confirm...等开头)，2-3句。",
    "描述图片内数据构成，4-7句。",
    "描述结果，3-5句。",
    "总结发现，2-3句。",
    "漂亮！您已完成本部分所需的所有内容！请点击左侧相应菜单进入下一部分的写作。"
  ],
  Discussion: [
    "综述领域背景和本文贡献，2-3句。",
    "描述本文发现，3-6句。",
    "对于自己的每个发现，先进行综述（1-3句）并引用前人研究（2-4句），之后进行对比（1-2句）。对结果结合前人研究进行解释（2-3句），最后进行一句话的总结。",
    "一段总结：我们的结果说明了（1-2句， Our study has demonstrated that...），有什么推论（2-3句，These results suggest that...），这篇文章的意义（1句）。这一段也可以作为Conclusion使用。",
    "漂亮！您已完成本部分所需的所有内容！请点击左侧相应菜单进入下一部分的写作。"
  ],
  Acknowledgement: [
    "写出在这个研究中帮助过您但不在作者列表的人。如果您能保留那段对我们产品的介绍将是对我们巨大的帮助, 也将激励我们为科学事业提供更多助力。 : )"
  ]
};
